Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: Absolute numbered groups were referred to using C, C, etc., and this notation is still accepted (and likely always will be).
es: Se hacía referencia a los grupos numerados de forma absoluta mediante C, C, etc. Esta notación sigue siendo válida (y probablemente siempre lo será).

source: Accepted in Perl 5.8.0 XXX
es: Se aprobó en Perl 5.8.0 XXX

source: Accepted in Perl XXX
es: Se aprobó en Perl XXX

source: Accepted in XXX
es: Se aprobó en XXX

source: Accessed via C<%ENV>.
es: Se puede acceder a estas variables a través de C<%ENV>.

source: Accesses would be to the structure without locking (which is not safe for Perl's scalars), and either the structure has to leak, or it has to be freed when its creating thread terminates, which may be before the optree referencing it is deleted, if other threads outlive it.
es: Los accesos se harían en la estructura sin bloquear (lo cual no es seguro para los escalares de Perl), por lo que la estructura acaba por perderse o hay que liberarla cuando finalice el hilo de ejecución que la creó; si le sobreviven otros hilos de ejecución, esto puede ocurrir antes de que se elimine la referencia al árbol sintáctico de operaciones.

source: Accessors make it easier to change the implementation of an object later while still preserving the original API.
es: Los métodos de acceso facilitan el cambio posterior de la implementación de un objeto manteniendo intacta la API original.

source: Actually, all languages do overloading to one extent or another, since people are good at figuring out things from L</context>.
es: En realidad, todos los lenguajes usan la sobrecarga en mayor o menor medida, ya que los humanos tenemos facilidad para interpretar las cosas en L</contexto>.

source: Actually, one good reason is when you already have an existing application written in another language that's all done (and done well), or you have an application language specifically designed for a certain task (e.g. prolog, make).
es: La verdad, una buena razón es tener una aplicación escrita en otro lenguaje que funciona bien y está bien programada, o disponer de un lenguaje para aplicaciones diseñado específicamente para una tarea determinada (como prolog o make).

source: Add to your standard heading the following line:
es: Agregue al encabezado estándar del programa la línea siguiente:

source: Additionally the R may be followed by a number, (which will be true when evaluated when recursing inside of the appropriate group), or by C<&NAME>, in which case it will be true only when evaluated during recursion in the named group.
es: Además, el símbolo R puede ir seguido de un número (que será verdadero cuando se evalúa en un proceso recursivo dentro del grupo correspondiente) o de C<&NOMBRE>, en cuyo caso sólo será verdadera cuando se evalúe durante la recursión en el grupo con nombre.

source: Additionally, all of its I<required> dependencies ship with the Perl core, and it can run without a compiler.
es: Además, todas las dependencias I<necesarias> están incluidas en el núcleo de Perl, de forma que puede ejecutarse sin necesidad de compilador.

source: Additionally, you can call methods on the C<STDIN>, C<STDOUT>, and C<STDERR> filehandles.
es: Además, también puede llamar a métodos en los identificadores de archivo C<STDIN>, C<STDOUT> y C<STDERR>.

source: After a clone the repository will contain a single local branch, which will be the current branch as well, as indicated by the asterisk.
es: Tras la clonación, el repositorio contendrá una sola rama local, que también será la rama actual, indicada mediante el asterisco.

source: After all, in your journey as a programmer, you are likely to encounter different styles.
es: Al fin y al cabo, en su vida profesional como programador se va a encontrar distintos estilos.

source: After installing cpan-mac, drop the module archive on the B<untarzipme> droplet, which will decompress and unpack for you.
es: Una vez instalado cpan-mac, coloque el archivo comprimido del módulo en el I<droplet> B<untarzipme>, que lo descomprimirá y desempaquetará.

source: After reading this document, you ought to read L<perlunifaq> too.
es: Después de leer este documento, debe leer L<perlunifaq>.

source: After this module-identifying prefix, the rest of the key is entirely up to the module: it may include any characters whatsoever.
es: A continuación de este prefijo de identificación de módulo, el resto de la clave queda a discreción del programador del módulo y puede incluir cualquier carácter.

source: Again, C<module-starter> and C<h2xs> provide a test framework which you can extend - you should do something more than just checking your module will compile.
es: C<module-starter> y C<h2xs> proporcionan un entorno de pruebas que puede ampliar; no debe limitarse a comprobar que el módulo se compila.

source: Again, for elementary pieces there is no such question, since at most one match at a given position is possible.
es: En este caso también, esta pregunta no tiene sentido para las partes elementales, ya que en una posición dada solo puede haber una coincidencia como máximo.

source: Again, this does not mean that Perl can do operations only over integers in this range: it is possible to store many more integers in floating point format.
es: Insistimos: esto no significa que Perl sólo puede realizar operaciones con enteros de este intervalo; es posible almacenar muchos más enteros en formato de punto flotante.

source: Again, this allows for very dynamic code.
es: Esto también permite crear código muy dinámico.

source: Again, you'll probably need to be root.
es: Para esto también necesitará privilegios de usuario raíz.

source: All Perl module files have the extension F<.pm>.
es: Todos los archivos de módulo Perl tienen la extensión F<.pm>.

source: All Rights Reserved.
es: Todos los derechos reservados.

source: All are different from C<[a-z]>, which specifies a class containing twenty-six characters, even on EBCDIC-based character sets.)
es: Todas son diferentes de C<[a-z]>, que especifica una clase que contiene veintiséis caracteres, incluso en los juegos de caracteres basados en EBCDIC).

source: All available translation packages are to be found under the C<POD2::> namespace.
es: Todos los paquetes de traducción de la documentación se encuentran en el espacio de nombres C<POD2::>.

source: All classes automatically inherit from the L<UNIVERSAL> class, which is built-in to the Perl core.
es: Todas las clases heredan automáticamente de la clase L<UNIVERSAL>, disponible en el núcleo de Perl.

source: All classes inherit from the L<UNIVERSAL> class implicitly.
es: Todas las clases heredan implícitamente de la clase L<UNIVERSAL>.

source: All communication with the outside world (anything outside of your current Perl process) is done in binary.
es: La comunicación con el mundo exterior (todo lo que esté fuera del proceso Perl actual) se realiza en binario.

source: All data in Perl is a scalar, an array of scalars, or a hash of scalars.
es: En Perl, todos los elementos de datos son escalares, arrays de escalares o hashes de escalares.

source: All filter methods return the existing filter, if present, or C<undef> if not.
es: Todos los métodos de filtro devuelven el filtro, si existe; de lo contrario, devuelven C<undef>.

source: All functions that are capable of creating filehandles (open(), opendir(), pipe(), socketpair(), sysopen(), socket(), and accept()) automatically create an anonymous filehandle if the handle passed to them is an uninitialized scalar variable.
es: Todas las funciones capaces de crear identificadores de archivo (open(), opendir(), pipe(), socketpair(), sysopen(), socket() y accept()) crean automáticamente un identificador de archivo anónimo si el identificador que se les pasa es una variable escalar sin inicializar.

source: All mp3 files are files, but not all files are mp3 files.
es: Todos los archivos mp3 son archivos, pero no todos los archivos son archivos mp3.

source: All objects belong to a specific class.
es: Todos los objetos pertenecen a una clase específica.

source: All of Perl's source code is kept centrally in a Git repository at I<perl5.git.perl.org>.
es: Todo el código fuente de Perl se almacena en un repositorio central de Git en I<perl5.git.perl.org>.

source: All of the core documentation intended for end users lives in F<pod/>.
es: Toda la documentación principal para usuarios finales se encuentra en F<pod/>.

source: All other characters are encoded as two or more (up to six) bytes using a complex scheme.
es: Todos los demás caracteres se codifican como dos o más bytes (hasta seis) mediante un esquema complejo.

source: All other periods in the filename should be replaced with underscores.
es: Debe reemplazar los demás puntos que haya en el nombre del archivo por guiones bajos.

source: All other symbols are kept in package C<main>, including all punctuation variables, like $_.
es: Todos los demás símbolos se almacenarán en el paquete C<main>, incluidas todas las variables de puntuación, como $_.

source: All rights reserved.
es: Todos los derechos reservados.

source: All text strings are in this internal format.
es: Todas las cadenas de texto tienen este formato interno

source: All the substrings which may be matched by the given regular expression can be sorted from the "best" match to the "worst" match, and it is the "best" match which is chosen.
es: Todas las subcadenas que pueden coincidir con la expresión regular dada se pueden clasificar desde la "mejor" coincidencia hasta la "peor" coincidencia, y la elegida es la "mejor" coincidencia.

source: All the examples so far have shown objects based on a blessed hash.
es: En todos los ejemplos considerados hasta ahora se han usado objetos basados en un hash bendecido.

source: All the operators which need an argument in the integer format treat the argument as in modular arithmetic, e.g., C<mod 2**32> on a 32-bit architecture.
es: Todos los operadores que necesitan un argumento con formato de entero tratan al argumento como en la aritmética modular (p. ej., C<mod 2**32> en una arquitectura de 32 bits).

source: Along the same lines, just because you I<CAN> omit parentheses in many places doesn't mean that you ought to:
es: Que sea B<posible> omitir los paréntesis en muchos lugares no significa que deba hacerlo:

source: Along with the Perl interpreter itself, the Perl distribution installs a range of utilities on your system.
es: Además del intérprete de Perl, la distribución de Perl incluye varias utilidades que se instalan en el sistema;

source: Also called a "superclass" by people who respect their ancestors.
es: Las personas que respetan a sus antepasados también la denominan "superclases".

source: Also called "keywords".
es: También se denominan "palabras clave".

source: Also called a "case structure", named after the similar Pascal construct.
es: También se denominada "estructura case", por una construcción similar del lenguaje Pascal.

source: Also called a "parameter".
es: También se denomina "parámetro".

source: Also called marshalling.
es: En inglés también se llama I<marshalling>.

source: Also coincidentally refers to a venerable text-processing language from which Perl derived some of its high-level ideas.
es: Casualmente, también hace referencia a un venerable lenguaje de procesamiento de texto del que Perl derivó algunas de sus ideas de alto nivel.

source: Also describes the bit in the mode word (L</permission bits>) that controls the feature.
es: También describe el bit de la palabra de modo (L</bits de permiso>) que controla la característica.

source: Also hence, this book.
es: Sin ella, no estaría leyendo esto.

source: Also known as "lexing", in which case you get "lexemes" instead of tokens.
es: También se llama "separar en lexemas", en cuyo caso obtenemos "lexemas" en lugar de tokens.

source: Also known as I<cpp>(1).
es: También se denomina I<cpp>(1).

source: Also note that anything inside a C<\Q...\E> stays unaffected by C</x>.
es: Recuerde también que lo que esté dentro de una secuencia C<\Q...\E> no se ve afectado por C</x>.

source: Also note that these instructions are tailored for installing the module into your system's repository of Perl modules, but you can install modules into any directory you wish.
es: También debe tener en cuenta que, aunque estas instrucciones son específicas de la instalación del módulo en el repositorio de módulos Perl de su sistema, puede instalar un módulo en cualquier directorio que desee.

source: Also refers to the strange prefixes that Perl requires as noun markers on its variables.
es: También hace referencia a los prefijos extraños que Perl usa como marcas de nombres en sus variables.

source: Also remember that "|" is interpreted as a literal within square brackets, so if you write C<[fee|fie|foe]> you're really only matching C<[feio|]>.
es: Debe recordar también que "|" se interpreta como un literal cuando está entre corchetes, por lo que buscar C<[fee|fie|foe]> equivale a buscar C<[feio|]>.

source: Also see L</Which character set modifier is in effect?>.
es: Vea también L</¿Qué modificador de juego de caracteres está en vigor?>.

source: Also shift operations internally use signed integers rather than the default unsigned.
es: Además, las operaciones de desplazamiento usan internamente enteros con signo en lugar de los enteros sin signo predeterminados.

source: Also the quality that makes you write (and maintain) programs that other people won't want to say bad things about.
es: También es la cualidad que permite escribir (y mantener) programas de forma que los demás no los puedan criticar.

source: Also used of computers that store the least significant L</byte> of a word at a lower byte address than the most significant byte.
es: También se usa para designar a los equipos que almacenan el L</byte> menos significativo de una palabra en una dirección de byte más baja que la del byte más significativo.

source: Also used of computers that store the most significant L</byte> of a word at a lower byte address than the least significant byte.
es: También se usa para designar a los equipos que almacenan el L</byte> más significativo de una palabra en una dirección de byte inferior a la del byte menos significativo.

source: Also used to describe a "non-text file", presumably because such a file makes full use of all the binary bits in its bytes.
es: También se usa para describir un "archivo que no es de texto", posiblemente porque dicho archivo usa todos los bits binarios de sus bytes.

source: Also used to mean the opposite of magic because everything works exactly as it appears, as in the three-argument form of L<open|perlfunc/open>.
es: También para indicar lo opuesto a lo mágico, porque todo funciona exactamente de la manera esperada, como el formato de tres argumentos de la función L<open|perlfunc/open>.

source: Also, Perl matching doesn't fully conform to the current Unicode C</i> recommendations, which ask that the matching be made upon the NFD (Normalization Form Decomposed) of the text.
es: Además, el sistema de detección de coincidencias de Perl no se ajusta plenamente a las recomendaciones actuales de Unicode relacionadas con C</i>, que piden que la coincidencia se base en la NFD (I<Normalization Form Decomposed>, o forma de normalización descompuesta) del texto.

source: Also, a similar operation on two L<strings|/string>.
es: Hace referencia a una operación similar con dos L<cadenas|/cadena>.

source: Also, a nickname for a L</named pipe>.
es: También es un apodo de L</tubería con nombre>.

source: Also, another name for an L</instance variable> of an L</object>.
es: También es un nombre alternativo para una L</variable de instancia> de un L</objeto>.

source: Also, if you try to use the character classes C<\w>, C<\W>, C<\s>, C<\S>, C<\d>, or C<\D> as endpoints of a range, the "-" is understood literally.
es: Además, si intenta utilizar las clases de caracteres C<\w>, C<\W>, C<\s>, C<\S>, C<\d> o C<\D> como valores finales de un rango, se trata el carácter "-" de forma literal.

source: Also, in the context of L</Unicode>, a writing system for a particular language or group of languages, such as Greek, Bengali, or Klingon.
es: Además, en el contexto de L</Unicode>, un sistema de escritura para un lenguaje o grupo de lenguajes específicos, como Griego, Bengalí o Klingon.

source: Also, it's worth noting that patterns defined this way probably will not be as efficient, as the optimiser is not very clever about handling them.
es: Además, hay que tener en cuenta que los patrones definidos de esta manera probablemente no sean tan eficientes, debido a que el optimizador no está preparado para procesarlos de forma eficaz.

source: Also, modifiers are resolved at compile time, so constructs like (?i:(?1)) or (?:(?i)(?1)) do not affect how the sub-pattern will be processed.
es: Además, los modificadores se resuelven en tiempo de compilación, por lo que construcciones como (?i:(?1)) o (?:(?i)(?1)) no afectan al modo en que se va a procesar el subpatrón.

source: Also, the C<$REGMARK> variable will be set to FALSE.
es: Además, la variable C<$REGMARK> se establece en FALSE.

source: Also, the result of converting code to run on a different platform than originally intended, or the verb denoting this conversion.
es: "Adaptación" es el resultado de convertir código para que se ejecute en una plataforma distinta de la original. "Adaptar" es el verbo usado para designar esta conversión.

source: Also, the top-level directory of the filesystem.
es: También es el directorio de nivel superior (raíz) del sistema de archivos.

source: Also, under this modifier, case-insensitive matching works on the full set of Unicode characters.
es: Además, con este modificador, la detección de coincidencias sin distinguir mayúsculas de minúsculas estará disponible para todo el juego de caracteres Unicode.

source: Alternatively, put this as the first line of your script:
es: Como alternativa, puede colocar al principio del script la siguiente línea:

source: Alternatively, you can download a pre-built PPM package from ActiveState.
es: Como alternativa, puede descargar un paquete PPM precompilado desde ActiveState:

source: Alternatively, you can quote the class name:
es: De forma alternativa, puede escribir entre comillas el nombre de la clase:

source: Alternatives are tried from left to right, so the first alternative found for which the entire expression matches, is the one that is chosen.
es: Las alternativas se procesan de izquierda a derecha, de modo que la primera alternativa encontrada que coincida con toda la expresión será la elegida.

source: Alternatives in normal Perl expressions are separated with a double vertical bar: C<||>.
es: En expresiones Perl normales, las alternativas se separan mediante una doble barra vertical: C<||>.

source: Although a scalar may not directly hold multiple values, it may contain a reference to an array or hash which in turn contains multiple values.
es: Aunque un escalar no puede contener directamente múltiples valores, podría contener una referencia a un array o un hash, que sí pueden contener múltiples valores.

source: Although all of these are documented with their appropriate topics, this succinct listing gives you an overview and basic facts about their status.
es: Aunque están documentadas en los temas correspondientes de la documentación, esta lista abreviada presenta una introducción y datos básicos sobre su estado de desarrollo actual.

source: Although in early versions of Perl, an undefined scalar could become defined when first used in a place expecting a defined value, this no longer happens except for rare cases of autovivification as explained in L<perlref>.
es: Aunque en las versiones anteriores de Perl un escalar no definido podía llegar a ser definido la primera vez que se usaba en cualquier lugar que esperase un valor definido, esto ya no es así, salvo en los raros casos de "autovivificación" que se describen en L<perlref>.

source: Although it retains most of the original content from its O'Reilly Network, it is now hosted by L<The Perl Foundation|http://www.perlfoundation.org/>.
es: Aunque conserva la mayor parte del contenido original de O'Reilly Network, ahora se hospeda en L<The Perl Foundation|http://www.perlfoundation.org/>.

source: Although optimized for scanning text, Perl also has many excellent tools for slicing and dicing binary data.
es: Aunque está optimizado para el procesamiento de texto, también incluye muchas herramientas magníficas para procesar datos binarios.

source: Although strings and numbers are considered pretty much the same thing for nearly all purposes, references are strongly-typed, uncastable pointers with builtin reference-counting and destructor invocation.
es: Aunque las cadenas y los números se consideran prácticamente la misma cosa para la mayoría de los propósitos, las referencias son punteros no convertibles y fuertemente tipados, que llevan un contador de referencias incorporado y una invocación al destructor.

source: Always check the return codes of system calls.
es: Compruebe siempre los valores devueltos por las llamadas al sistema.

source: An "independent" subexpression, one which matches the substring that a I<standalone> C<pattern> would match if anchored at the given position, and it matches I<nothing other than this substring>.
es: Un subexpresión "independiente", que coincide con la subcadena con la que coincidiría un C<patrón> I<independiente> si estuviera anclado en la posición indicada, y no coincide con I<nada más que con esta subcadena>.

source: An B<object> is a data structure that bundles together data and subroutines which operate on that data.
es: Un B<objeto> es una estructura de datos que empaqueta datos y subrutinas que operan sobre los datos.

source: An C<END> code block is executed as late as possible, that is, after perl has finished running the program and just before the interpreter is being exited, even if it is exiting as a result of a die() function.
es: El bloque de código C<END> se ejecuta tan tarde como sea posible, es decir, una vez que Perl ha finalizado la ejecución del programa y justo antes de que se produzca la salida del intérprete, incluso si la salida se debe a la ejecución de la función die()

source: An C B<is-a> I<more specific> type of C<File>.
es: Un objeto de la clase C es un (B<is-a>) tipo de objeto I<más específico> que un objeto de la clase C<Archivo>.

source: An L</anonymous> subroutine that, when a reference to it is generated at run time, keeps track of the identities of externally visible L<lexical variables|/lexical variable> even after those lexical variables have supposedly gone out of L</scope>.
es: Subrutina L<anónima|/anónimo> tal que, cuando se genera una referencia a ella en tiempo de ejecución, hace un seguimiento de las identidades de L<variables léxicas|/variable léxica> visibles externamente, incluso después de que dichas variables léxicas se salgan del L</ámbito>.

source: An L</argument>-passing mechanism in which the L</formal arguments> refer directly to the L</actual arguments>, and the L</subroutine> can change the actual arguments by changing the formal arguments.
es: Mecanismo para pasar L</argumentos> en el que los L</argumentos formales> hacen referencia directa a los L</argumentos reales> y la L</subrutina> puede cambiar los argumentos reales modificando los argumentos formales.
